Revit 2027 API
VisibleInViewFilter(Document, ElementId) Constructor
 Constructs a new instance of a VisibleInViewFilter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VisibleInViewFilter(
	Document document,
	ElementId viewId
)
Public Sub New (
	document As Document,
	viewId As ElementId
)
public:
VisibleInViewFilter(
	Document^ document,
	ElementId^ viewId
)
new :
        document : Document *
        viewId : ElementId -> VisibleInViewFilter
Parameters
document Document
 The document that owns the view.
viewId ElementId
 The view id.
Exceptions
Exception | Condition
ArgumentException |  viewId is not a view. -or- viewId is not valid for element iteration, because it has no way of representing drawn elements. Many view templates will fail this check.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
VisibleInViewFilter Class
VisibleInViewFilter Overload
Autodesk.Revit.DB Namespace